# Pandas

- 부동 소수점이 아닌 데이터뿐만 아니라 부동 소수점 데이터에서도 결측 데이터를 쉽게 처리
- 크기변이성(Size mutability) : DataFrame 및 고차원객체에서 열을 삽입 및 삭제 가능
- 자동 및 명시적(explicit) 데이터 정렬 : 객체를 라벨 집합에 명시적으로 정렬하거나, 사용자가 라벨을 무시하고 Series, DataFrame 등의 계산에서 자동으로 데이터 조정 가능
- 데이터세트에서 집계 및 변환을 위한 분할(split), 적용(apply), 결합(combine) 작업을 수행할 수 있는 강력하고 유연한 group-by 함수 제공
- 누락된 데이터 또는 다른 python 및 numpy 데이터 구조에서 서로 다른 인덱싱 데이터를 DataFrame 개체로 쉽게 변환
- 대용량 데이터세트의 지능령 라벨 기반 슬라이싱, 고급 인덱싱 및 부분 집합 구하기 가능
0 직관적인 데이터세트 병합 및 결합
- 데이터세트의 유연한 재구성 및 피벗
- 축의 계층적 라벨링(눈금당 여러개의 라벨을 가질 수 있음)
- 플랫파일(csv 및 구분), Excel파일, 데이터베이스 로딩 및 초고속 HDF5형식의 데이터 저장/로드에 사용되는 강력한 IO도구
- 시계열 특정 기능 : 날짜 범위 생성 및 주파수 변환, 무빙 윈도우(moving window)통계, 날짜 이동 및 지연

In [4]:
import numpy as np
import pandas as pd
pd.__version__

'1.2.4'

## Pandas 객체

- Series 객체

In [5]:
s = pd.Series([0, 0.25, 0.5, 0.75, 1.0])
s

0    0.00
1    0.25
2    0.50
3    0.75
4    1.00
dtype: float64

In [7]:
s.values

array([0.  , 0.25, 0.5 , 0.75, 1.  ])

In [8]:
s.index

RangeIndex(start=0, stop=5, step=1)

In [10]:
s[1]

0.25

In [11]:
s[1:4]

1    0.25
2    0.50
3    0.75
dtype: float64

In [12]:
s = pd.Series([0, 0.25, 0.5, 0.75, 1.0],
             index = ['a','b','c','d','e'])
s

a    0.00
b    0.25
c    0.50
d    0.75
e    1.00
dtype: float64

In [13]:
s['c']

0.5

In [14]:
s[['c', 'd', 'e']]

c    0.50
d    0.75
e    1.00
dtype: float64

In [15]:
'b' in s

True

In [16]:
s = pd.Series([0, 0.25, 0.5, 0.75, 1.0],
             index = [2, 4, 6, 8, 10])
s

2     0.00
4     0.25
6     0.50
8     0.75
10    1.00
dtype: float64

In [17]:
s[4]

0.25

In [18]:
s[2:]

6     0.50
8     0.75
10    1.00
dtype: float64

In [19]:
s.unique()

array([0.  , 0.25, 0.5 , 0.75, 1.  ])

In [21]:
s.value_counts()

0.00    1
1.00    1
0.50    1
0.75    1
0.25    1
dtype: int64

In [22]:
s.isin([0.25, 0.75])

2     False
4      True
6     False
8      True
10    False
dtype: bool

In [23]:
pop_tuple = {'서울특별시' : 9720846,
            '부산광역시' : 3484423,
            '인천광역시' : 2947217,
            '대구광역시' : 2428925,
            '대전광역시' : 1470480,
            '광주광역시' : 1455048}
population = pd.Series(pop_tuple)
population

서울특별시    9720846
부산광역시    3484423
인천광역시    2947217
대구광역시    2428925
대전광역시    1470480
광주광역시    1455048
dtype: int64

In [24]:
population['서울특별시']

9720846

In [26]:
population['서울특별시' : '인천광역시']

서울특별시    9720846
부산광역시    3484423
인천광역시    2947217
dtype: int64

- DataFrame 객체

In [27]:
pd.DataFrame([{'A' : 2, 'B':4, 'D':3}, {'A':4, 'B':5, 'C':7}])

   A  B    D    C
0  2  4  3.0  NaN
1  4  5  NaN  7.0

In [28]:
pd.DataFrame(np.random.rand(5, 5),
            columns = ['A', 'B', 'C', 'D', 'E'],
            index = [1, 2, 3, 4,5])

          A         B         C         D         E
1  0.399202  0.260817  0.438929  0.716304  0.503384
2  0.520001  0.900612  0.822400  0.070364  0.568879
3  0.826117  0.606429  0.414692  0.376639  0.482361
4  0.629886  0.001630  0.892158  0.752221  0.508970
5  0.203543  0.727786  0.385784  0.126662  0.209478

In [29]:
male_tuple = {'서울특별시' : 4732275,
            '부산광역시' : 1668618,
            '인천광역시' : 1476813,
            '대구광역시' : 1169815,
            '대전광역시' : 734441,
            '광주광역시' : 720060}
male = pd.Series(male_tuple)
male

서울특별시    4732275
부산광역시    1668618
인천광역시    1476813
대구광역시    1169815
대전광역시     734441
광주광역시     720060
dtype: int64

In [30]:
female_tuple = {'서울특별시' : 4988571,
            '부산광역시' : 1735805,
            '인천광역시' : 1470404,
            '대구광역시' : 1229391,
            '대전광역시' : 736559,
            '광주광역시' : 739488}
female = pd.Series(female_tuple)
female

서울특별시    4988571
부산광역시    1735805
인천광역시    1470404
대구광역시    1229391
대전광역시     736559
광주광역시     739488
dtype: int64

In [82]:
korea_df = pd.DataFrame({'인구수': population,
                        '남자인구수' : male,
                        '여자인구수' : female})
korea_df

           인구수    남자인구수    여자인구수
서울특별시  9720846  4732275  4988571
부산광역시  3484423  1668618  1735805
인천광역시  2947217  1476813  1470404
대구광역시  2428925  1169815  1229391
대전광역시  1470480   734441   736559
광주광역시  1455048   720060   739488

In [32]:
korea_df.index

Index(['서울특별시', '부산광역시', '인천광역시', '대구광역시', '대전광역시', '광주광역시'], dtype='object')

In [33]:
korea_df.columns

Index(['인구수', '남자인구수', '여자인구수'], dtype='object')

In [34]:
korea_df['여자인구수']

서울특별시    4988571
부산광역시    1735805
인천광역시    1470404
대구광역시    1229391
대전광역시     736559
광주광역시     739488
Name: 여자인구수, dtype: int64

In [35]:
korea_df['서울특별시':'인천광역시']

           인구수    남자인구수    여자인구수
서울특별시  9720846  4732275  4988571
부산광역시  3484423  1668618  1735805
인천광역시  2947217  1476813  1470404

- Index 객체

In [36]:
idx = pd.Index([2, 4, 6, 8, 10])
idx

Int64Index([2, 4, 6, 8, 10], dtype='int64')

In [37]:
idx[1]

4

In [38]:
idx[1:2:2]

Int64Index([4], dtype='int64')

In [40]:
idx[-1:]

Int64Index([10], dtype='int64')

In [41]:
idx[::2]

Int64Index([2, 6, 10], dtype='int64')

In [42]:
print(idx)
print(idx.size)
print(idx.shape)
print(idx.ndim)
print(idx.dtype)

Int64Index([2, 4, 6, 8, 10], dtype='int64')
5
(5,)
1
int64

- Index 연산

In [56]:
idx1 = pd.Index([1, 2, 4, 6, 8])
idx2 = pd.Index([2, 4, 5, 6, 7])
print(idx1.append(idx2))
print(idx1.difference(idx2))
print(idx1 - idx2)
print(idx1.intersection(idx2))   # 교집합
print(idx1 & idx2)
print(idx1.union(idx2))          # 두 인덱스를 합
print(idx1 | idx2)
print(idx1.delete(0))
print(idx1.drop(1))
print(idx1 ^ idx2)              # 여집합

Int64Index([1, 2, 4, 6, 8, 2, 4, 5, 6, 7], dtype='int64')
Int64Index([1, 8], dtype='int64')
Int64Index([-1, -2, -1, 0, 1], dtype='int64')
Int64Index([2, 4, 6], dtype='int64')
Int64Index([2, 4, 6], dtype='int64')
Int64Index([1, 2, 4, 5, 6, 7, 8], dtype='int64')
Int64Index([1, 2, 4, 5, 6, 7, 8], dtype='int64')
Int64Index([2, 4, 6, 8], dtype='int64')
Int64Index([2, 4, 6, 8], dtype='int64')
Int64Index([1, 5, 7, 8], dtype='int64')

<ipython-input-56-a29636cc8867>:7: FutureWarning: Index.__and__ operating as a set operation is deprecated, in the future this will be a logical operation matching Series.__and__.  Use index.intersection(other) instead
  print(idx1 & idx2)
<ipython-input-56-a29636cc8867>:9: FutureWarning: Index.__or__ operating as a set operation is deprecated, in the future this will be a logical operation matching Series.__or__.  Use index.union(other) instead
  print(idx1 | idx2)
<ipython-input-56-a29636cc8867>:12: FutureWarning: Index.__xor__ operating as a set operation is deprecated, in the future this will be a logical operation matching Series.__xor__.  Use index.symmetric_difference(other) instead
  print(idx1 ^ idx2)

- 인덱싱(Indexing)

In [57]:
s = pd.Series([0, 0.25, 0.5, 0.75, 1.0],
             index = ['a','b','c','d','e'])
s

a    0.00
b    0.25
c    0.50
d    0.75
e    1.00
dtype: float64

In [58]:
s['b']

0.25

In [60]:
s.keys()

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [61]:
list(s.items())

[('a', 0.0), ('b', 0.25), ('c', 0.5), ('d', 0.75), ('e', 1.0)]

In [62]:
s['f'] = 1.25
s

a    0.00
b    0.25
c    0.50
d    0.75
e    1.00
f    1.25
dtype: float64

In [63]:
s['a' : 'd']

a    0.00
b    0.25
c    0.50
d    0.75
dtype: float64

In [64]:
s[0:4]

a    0.00
b    0.25
c    0.50
d    0.75
dtype: float64

In [65]:
# 특정 조건 주어진 후, 해당 값 출력

s[(s > 0.4) & (s < 0.8)]

c    0.50
d    0.75
dtype: float64

In [66]:
s[['a', 'c', 'e']]

a    0.0
c    0.5
e    1.0
dtype: float64

- Series 인덱싱

In [67]:
s = pd.Series(['a', 'b', 'c', 'd', 'e'],
             index = [1, 3, 5, 7, 9])
s

1    a
3    b
5    c
7    d
9    e
dtype: object

In [68]:
s[1]

'a'

In [70]:
s.iloc[1]

'b'

In [71]:
s.iloc[2:4]

5    c
7    d
dtype: object

In [72]:
s.reindex(range(10))

0    NaN
1      a
2    NaN
3      b
4    NaN
5      c
6    NaN
7      d
8    NaN
9      e
dtype: object

In [73]:
# 비어있는 Index들을 전에 있던 값으로 채우기

s.reindex(range(10), method = 'bfill')

0    a
1    a
2    b
3    b
4    c
5    c
6    d
7    d
8    e
9    e
dtype: object

- DataFrame 인덱싱

In [81]:
korea_df

           인구수    남자인구수    여자인구수          남여비율
서울특별시  9720846  4732275  4988571   9486.233633
부산광역시  3484423  1668618  1735805   9612.934633
인천광역시  2947217  1476813  1470404  10043.586661
대구광역시  2428925  1169815  1229391   9515.402341
대전광역시  1470480   734441   736559   9971.244666
광주광역시  1455048   720060   739488   9737.277684

In [75]:
korea_df['남자인구수']

서울특별시    4732275
부산광역시    1668618
인천광역시    1476813
대구광역시    1169815
대전광역시     734441
광주광역시     720060
Name: 남자인구수, dtype: int64

In [76]:
korea_df.남자인구수

서울특별시    4732275
부산광역시    1668618
인천광역시    1476813
대구광역시    1169815
대전광역시     734441
광주광역시     720060
Name: 남자인구수, dtype: int64

In [78]:
korea_df.인구수

서울특별시    9720846
부산광역시    3484423
인천광역시    2947217
대구광역시    2428925
대전광역시    1470480
광주광역시    1455048
Name: 인구수, dtype: int64

In [84]:
korea_df['남여비율'] = (korea_df['남자인구수'] * 100 / korea_df['여자인구수'] )
korea_df

           인구수    남자인구수    여자인구수        남여비율
서울특별시  9720846  4732275  4988571   94.862336
부산광역시  3484423  1668618  1735805   96.129346
인천광역시  2947217  1476813  1470404  100.435867
대구광역시  2428925  1169815  1229391   95.154023
대전광역시  1470480   734441   736559   99.712447
광주광역시  1455048   720060   739488   97.372777

In [85]:
korea_df.values

array([[9.72084600e+06, 4.73227500e+06, 4.98857100e+06, 9.48623363e+01],
       [3.48442300e+06, 1.66861800e+06, 1.73580500e+06, 9.61293463e+01],
       [2.94721700e+06, 1.47681300e+06, 1.47040400e+06, 1.00435867e+02],
       [2.42892500e+06, 1.16981500e+06, 1.22939100e+06, 9.51540234e+01],
       [1.47048000e+06, 7.34441000e+05, 7.36559000e+05, 9.97124467e+01],
       [1.45504800e+06, 7.20060000e+05, 7.39488000e+05, 9.73727768e+01]])

In [86]:
korea_df.T

,서울특별시,부산광역시,인천광역시,대구광역시,대전광역시,광주광역시
인구수,9.720846e+06,3.484423e+06,2.947217e+06,2.428925e+06,1.470480e+06,1.455048e+06
남자인구수,4.732275e+06,1.668618e+06,1.476813e+06,1.169815e+06,7.344410e+05,7.200600e+05
여자인구수,4.988571e+06,1.735805e+06,1.470404e+06,1.229391e+06,7.365590e+05,7.394880e+05
남여비율,9.486234e+01,9.612935e+01,1.004359e+02,9.515402e+01,9.971245e+01,9.737278e+01

In [87]:
korea_df.values[0]

array([9.72084600e+06, 4.73227500e+06, 4.98857100e+06, 9.48623363e+01])

In [88]:
korea_df['인구수']

서울특별시    9720846
부산광역시    3484423
인천광역시    2947217
대구광역시    2428925
대전광역시    1470480
광주광역시    1455048
Name: 인구수, dtype: int64

In [89]:
korea_df.loc[:'인천광역시', :'남자인구수']

           인구수    남자인구수
서울특별시  9720846  4732275
부산광역시  3484423  1668618
인천광역시  2947217  1476813

In [91]:
korea_df.loc[(korea_df.여자인구수 > 1000000)]

           인구수    남자인구수    여자인구수        남여비율
서울특별시  9720846  4732275  4988571   94.862336
부산광역시  3484423  1668618  1735805   96.129346
인천광역시  2947217  1476813  1470404  100.435867
대구광역시  2428925  1169815  1229391   95.154023

In [92]:
korea_df.loc[(korea_df.인구수 < 2000000)]

           인구수   남자인구수   여자인구수       남여비율
대전광역시  1470480  734441  736559  99.712447
광주광역시  1455048  720060  739488  97.372777

In [93]:
korea_df.loc[(korea_df.인구수 > 2500000)]

           인구수    남자인구수    여자인구수        남여비율
서울특별시  9720846  4732275  4988571   94.862336
부산광역시  3484423  1668618  1735805   96.129346
인천광역시  2947217  1476813  1470404  100.435867

In [94]:
korea_df.loc[korea_df.남여비율 > 100]

           인구수    남자인구수    여자인구수        남여비율
인천광역시  2947217  1476813  1470404  100.435867

In [95]:
korea_df.loc[(korea_df.인구수 > 2500000) & (korea_df.남여비율 > 100)]

           인구수    남자인구수    여자인구수        남여비율
인천광역시  2947217  1476813  1470404  100.435867

In [96]:
korea_df.iloc[:3, :2]

           인구수    남자인구수
서울특별시  9720846  4732275
부산광역시  3484423  1668618
인천광역시  2947217  1476813

- 다중인덱싱(Multi Indexing)
    - 1차원의 Series와 2차원의 DataFrame 객체를 넘어 3차원, 4차원 이상의 고차원 데이터처리
    - 단일인덱스 내에 여러 인덱스를 포함하는 다중인덱싱

In [97]:
korea_df

           인구수    남자인구수    여자인구수        남여비율
서울특별시  9720846  4732275  4988571   94.862336
부산광역시  3484423  1668618  1735805   96.129346
인천광역시  2947217  1476813  1470404  100.435867
대구광역시  2428925  1169815  1229391   95.154023
대전광역시  1470480   734441   736559   99.712447
광주광역시  1455048   720060   739488   97.372777

In [98]:
idx_tuples = [('서울특별시', 2010), ('서울특별시', 2020),
            ('부산광역시', 2010), ('부산광역시', 2020),
            ('인천광역시', 2010), ('인천광역시', 2020),
            ('대구광역시', 2010), ('대구광역시', 2020),
            ('대전광역시', 2010), ('대전광역시', 2020),
            ('광주광역시', 2010), ('광주광역시', 2020)]
idx_tuples

[('서울특별시', 2010),
 ('서울특별시', 2020),
 ('부산광역시', 2010),
 ('부산광역시', 2020),
 ('인천광역시', 2010),
 ('인천광역시', 2020),
 ('대구광역시', 2010),
 ('대구광역시', 2020),
 ('대전광역시', 2010),
 ('대전광역시', 2020),
 ('광주광역시', 2010),
 ('광주광역시', 2020)]

In [99]:
pop_tuples = [1031245, 9728846, 2567910, 3404423, 2758296, 2947217, 2511676, 2427954, 1503664, 1471040, 1454636, 1455048]
population = pd.Series(pop_tuples, index = idx_tuples)
population

(서울특별시, 2010)    1031245
(서울특별시, 2020)    9728846
(부산광역시, 2010)    2567910
(부산광역시, 2020)    3404423
(인천광역시, 2010)    2758296
(인천광역시, 2020)    2947217
(대구광역시, 2010)    2511676
(대구광역시, 2020)    2427954
(대전광역시, 2010)    1503664
(대전광역시, 2020)    1471040
(광주광역시, 2010)    1454636
(광주광역시, 2020)    1455048
dtype: int64

In [100]:
midx = pd.MultiIndex.from_tuples(idx_tuples)
midx

MultiIndex([('서울특별시', 2010),
            ('서울특별시', 2020),
            ('부산광역시', 2010),
            ('부산광역시', 2020),
            ('인천광역시', 2010),
            ('인천광역시', 2020),
            ('대구광역시', 2010),
            ('대구광역시', 2020),
            ('대전광역시', 2010),
            ('대전광역시', 2020),
            ('광주광역시', 2010),
            ('광주광역시', 2020)],
           )

In [101]:
population = population.reindex(midx)
population

서울특별시  2010    1031245
       2020    9728846
부산광역시  2010    2567910
       2020    3404423
인천광역시  2010    2758296
       2020    2947217
대구광역시  2010    2511676
       2020    2427954
대전광역시  2010    1503664
       2020    1471040
광주광역시  2010    1454636
       2020    1455048
dtype: int64

In [102]:
population[:, 2010]

서울특별시    1031245
부산광역시    2567910
인천광역시    2758296
대구광역시    2511676
대전광역시    1503664
광주광역시    1454636
dtype: int64

In [105]:
population['대전광역시', :]

2010    1503664
2020    1471040
dtype: int64

In [106]:
korea_mdf = population.unstack()
korea_mdf

          2010     2020
광주광역시  1454636  1455048
대구광역시  2511676  2427954
대전광역시  1503664  1471040
부산광역시  2567910  3404423
서울특별시  1031245  9728846
인천광역시  2758296  2947217

In [107]:
korea_mdf.stack()

광주광역시  2010    1454636
       2020    1455048
대구광역시  2010    2511676
       2020    2427954
대전광역시  2010    1503664
       2020    1471040
부산광역시  2010    2567910
       2020    3404423
서울특별시  2010    1031245
       2020    9728846
인천광역시  2010    2758296
       2020    2947217
dtype: int64

In [108]:
male_tuple = [5111259, 4732275,
             1773170, 1668618, 
             1390356, 1476813, 
             1255245, 1198815, 
             753648, 734441, 
             721780, 720060]
male_tuple

[5111259,
 4732275,
 1773170,
 1668618,
 1390356,
 1476813,
 1255245,
 1198815,
 753648,
 734441,
 721780,
 720060]

In [109]:
korea_mdf = pd.DataFrame({'총인구수': population, 
                         '남자인구수' : male_tuple})
korea_mdf

               총인구수    남자인구수
서울특별시 2010  1031245  5111259
      2020  9728846  4732275
부산광역시 2010  2567910  1773170
      2020  3404423  1668618
인천광역시 2010  2758296  1390356
      2020  2947217  1476813
대구광역시 2010  2511676  1255245
      2020  2427954  1198815
대전광역시 2010  1503664   753648
      2020  1471040   734441
광주광역시 2010  1454636   721780
      2020  1455048   720060

In [110]:
female_tuples = [5201286, 4988571,
                1794740, 1735805,
                1367940, 1470404,
                1256431, 1229139,
                750016, 736599,
                732856, 734988]
female_tuples

[5201286,
 4988571,
 1794740,
 1735805,
 1367940,
 1470404,
 1256431,
 1229139,
 750016,
 736599,
 732856,
 734988]

In [112]:
korea_mdf = pd.DataFrame({'총인구수': population, 
                         '남자인구수' : male_tuple,
                         '여자인구수': female_tuples})
korea_mdf

               총인구수    남자인구수    여자인구수
서울특별시 2010  1031245  5111259  5201286
      2020  9728846  4732275  4988571
부산광역시 2010  2567910  1773170  1794740
      2020  3404423  1668618  1735805
인천광역시 2010  2758296  1390356  1367940
      2020  2947217  1476813  1470404
대구광역시 2010  2511676  1255245  1256431
      2020  2427954  1198815  1229139
대전광역시 2010  1503664   753648   750016
      2020  1471040   734441   736599
광주광역시 2010  1454636   721780   732856
      2020  1455048   720060   734988

In [113]:
ratio = korea_mdf['남자인구수'] * 100 / korea_mdf['여자인구수']
ratio

서울특별시  2010     98.269140
       2020     94.862336
부산광역시  2010     98.798155
       2020     96.129346
인천광역시  2010    101.638668
       2020    100.435867
대구광역시  2010     99.905606
       2020     97.532907
대전광역시  2010    100.484256
       2020     99.707032
광주광역시  2010     98.488653
       2020     97.968946
dtype: float64

In [114]:
ratio.unstack()

             2010        2020
광주광역시   98.488653   97.968946
대구광역시   99.905606   97.532907
대전광역시  100.484256   99.707032
부산광역시   98.798155   96.129346
서울특별시   98.269140   94.862336
인천광역시  101.638668  100.435867

In [115]:
korea_mdf = pd.DataFrame({'총인구수': population, 
                         '남자인구수' : male_tuple,
                         '여자인구수': female_tuples,
                         '남여비율' : ratio})
korea_mdf

               총인구수    남자인구수    여자인구수        남여비율
서울특별시 2010  1031245  5111259  5201286   98.269140
      2020  9728846  4732275  4988571   94.862336
부산광역시 2010  2567910  1773170  1794740   98.798155
      2020  3404423  1668618  1735805   96.129346
인천광역시 2010  2758296  1390356  1367940  101.638668
      2020  2947217  1476813  1470404  100.435867
대구광역시 2010  2511676  1255245  1256431   99.905606
      2020  2427954  1198815  1229139   97.532907
대전광역시 2010  1503664   753648   750016  100.484256
      2020  1471040   734441   736599   99.707032
광주광역시 2010  1454636   721780   732856   98.488653
      2020  1455048   720060   734988   97.968946

- 다중인덱싱 생성

In [116]:
df = pd.DataFrame(np.random.rand(6, 3),
                  index = [['a', 'a', 'b', 'b', 'c', 'c'], [1, 2, 1, 2, 1, 2]],
                  columns = ['c1', 'c2', 'c3'])
df

           c1        c2        c3
a 1  0.969247  0.109416  0.191030
  2  0.211611  0.153657  0.587700
b 1  0.191823  0.185228  0.676615
  2  0.385451  0.395749  0.072623
c 1  0.898000  0.177794  0.313497
  2  0.245923  0.659384  0.391564

In [117]:
pd.MultiIndex.from_arrays([['a', 'a', 'b', 'b', 'c', 'c'], [1, 2, 1, 2, 1, 2]])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2),
            ('c', 1),
            ('c', 2)],
           )

In [119]:
pd.MultiIndex.from_tuples([('a',1), ('a', 2), ('b', 1), ('b', 2), ('c', 1), ('c', 2)])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2),
            ('c', 1),
            ('c', 2)],
           )

In [120]:
pd.MultiIndex.from_product((['a', 'b', 'c'], [1, 2]))

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2),
            ('c', 1),
            ('c', 2)],
           )

In [121]:
pd.MultiIndex(levels = [['a','b','c'], [1, 2]],
             codes = [[0, 0, 1, 1, 2, 2], [0, 1, 0, 1, 0, 1]])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2),
            ('c', 1),
            ('c', 2)],
           )

In [122]:
population

서울특별시  2010    1031245
       2020    9728846
부산광역시  2010    2567910
       2020    3404423
인천광역시  2010    2758296
       2020    2947217
대구광역시  2010    2511676
       2020    2427954
대전광역시  2010    1503664
       2020    1471040
광주광역시  2010    1454636
       2020    1455048
dtype: int64

In [124]:
population.index.names = ['행정구역', '년도']
population

행정구역   년도
서울특별시  2010    1031245
       2020    9728846
부산광역시  2010    2567910
       2020    3404423
인천광역시  2010    2758296
       2020    2947217
대구광역시  2010    2511676
       2020    2427954
대전광역시  2010    1503664
       2020    1471040
광주광역시  2010    1454636
       2020    1455048
dtype: int64

In [126]:
idx = pd.MultiIndex.from_product([['a', 'b', 'c'], [1, 2]],
                                 names = ['name1', 'name2'])
cols = pd.MultiIndex.from_product([['c1', 'c2', 'c3'], [1, 2]],
                                  names = ['col_name1', 'col_name2'])
data = np.round(np.random.randn(6, 6), 2)
mdf = pd.DataFrame(data, index = idx, columns = cols)
mdf

col_name1      c1          c2          c3
col_name2       1     2     1     2     1     2
name1 name2
a     1     -0.68 -0.44 -0.66  0.06 -1.79 -0.79
      2      0.58  0.44  0.04 -0.53  1.00 -1.59
b     1      1.26  0.34 -0.57  1.11 -0.16  1.01
      2      1.41 -0.35  0.60 -0.55  0.71 -1.50
c     1      0.31  0.21 -1.31  1.61 -1.98  0.10
      2     -0.77  0.03 -0.65 -1.13 -1.06 -0.76

In [127]:
mdf['c2']

col_name2       1     2
name1 name2
a     1     -0.66  0.06
      2      0.04 -0.53
b     1     -0.57  1.11
      2      0.60 -0.55
c     1     -1.31  1.61
      2     -0.65 -1.13

- 인덱싱 및 슬라이싱

In [128]:
population

행정구역   년도
서울특별시  2010    1031245
       2020    9728846
부산광역시  2010    2567910
       2020    3404423
인천광역시  2010    2758296
       2020    2947217
대구광역시  2010    2511676
       2020    2427954
대전광역시  2010    1503664
       2020    1471040
광주광역시  2010    1454636
       2020    1455048
dtype: int64

In [129]:
population['인천광역시', 2010]

2758296

In [132]:
population[:, 2010]

행정구역
서울특별시    1031245
부산광역시    2567910
인천광역시    2758296
대구광역시    2511676
대전광역시    1503664
광주광역시    1454636
dtype: int64

In [133]:
population[population > 3000000]

행정구역   년도
서울특별시  2020    9728846
부산광역시  2020    3404423
dtype: int64

In [134]:
population[['대구광역시', '대전광역시']]

행정구역   년도
대구광역시  2010    2511676
       2020    2427954
대전광역시  2010    1503664
       2020    1471040
dtype: int64

In [135]:
mdf

col_name1      c1          c2          c3
col_name2       1     2     1     2     1     2
name1 name2
a     1     -0.68 -0.44 -0.66  0.06 -1.79 -0.79
      2      0.58  0.44  0.04 -0.53  1.00 -1.59
b     1      1.26  0.34 -0.57  1.11 -0.16  1.01
      2      1.41 -0.35  0.60 -0.55  0.71 -1.50
c     1      0.31  0.21 -1.31  1.61 -1.98  0.10
      2     -0.77  0.03 -0.65 -1.13 -1.06 -0.76

In [138]:
mdf['c2', 1]

name1  name2
a      1       -0.66
       2        0.04
b      1       -0.57
       2        0.60
c      1       -1.31
       2       -0.65
Name: (c2, 1), dtype: float64

In [139]:
mdf.iloc[:3, :4]

col_name1      c1          c2
col_name2       1     2     1     2
name1 name2
a     1     -0.68 -0.44 -0.66  0.06
      2      0.58  0.44  0.04 -0.53
b     1      1.26  0.34 -0.57  1.11

In [140]:
mdf.loc[:, ('c2', 1)]

name1  name2
a      1       -0.66
       2        0.04
b      1       -0.57
       2        0.60
c      1       -1.31
       2       -0.65
Name: (c2, 1), dtype: float64

In [142]:
idx_slice = pd.IndexSlice
mdf.loc[idx_slice[:, 2], idx_slice[:, 2]]

col_name1      c1    c2    c3
col_name2       2     2     2
name1 name2
a     2      0.44 -0.53 -1.59
b     2     -0.35 -0.55 -1.50
c     2      0.03 -1.13 -0.76

- 다중 인덱스 재정렬